'''Реализовать проект расчёта суммарного расхода ткани на производство одежды.
Основная сущность (класс) этого проекта — одежда, которая может иметь определённое название.
К типам одежды в этом проекте относятся пальто и костюм. У этих типов одежды существуют параметры:
размер (для пальто) и рост (для костюма). Это могут быть обычные числа: V и H, соответственно.
Для определения расхода ткани по каждому типу одежды использовать формулы: для пальто (V/6.5 + 0.5),
для костюма(2*H + 0.3). Проверить работу этих методов на реальных данных.
Выполнить общий подсчёт расхода ткани. Проверить на практике полученные на этом уроке знания.
Реализовать абстрактные классы для основных классов проекта и проверить работу декоратора @property.
'''

class New:
    def __init__(self, type, size):
        self.type = type
        self.size = size

        if type == 'Пальто':
            self.rashod = (size / 6.5 + 0.5)
        elif type == 'Костюм':
            self.rashod = (2 * size + 0.3)
        else:
            self.rashod = 'определить нельзя. Неверно задан тип одежды'

    def __str__(self):
        return f'Расход ткани {self.rashod}'

my_class = New('Костюм', 10)
print(my_class)


