'''
Задание 2
* Создать список, состоящий из кубов нечётных чисел от 1 до 1000
  (куб X - третья степень числа X):
* Вычислить сумму тех чисел из этого списка, сумма цифр которых делится нацело на 7.
  Например, число «19 ^ 3 = 6859» будем включать в сумму,
  так как 6 + 8 + 5 + 9 = 28 – делится нацело на 7.
Внимание: использовать только арифметические операции!
* К каждому элементу списка добавить 17 и заново вычислить сумму тех чисел из
  этого списка, сумма цифр которых делится нацело на 7.
* Решить задачу под пунктом b, не создавая новый список.)
'''

def sum_list_1(dataset: list) -> int:
    """Вычисляет сумму чисел списка dataset, сумма цифр которых делится нацело на 7"""
    sum_numbers = 0
    for number in dataset:
        sum_digits = 0
        for i in range(len(number)):
            sum_digits += int(number[i])
            if sum_digits % 7 == 0:
                sum_numbers += int(number)
    return sum_numbers  # Верните значение полученной суммы

def sum_list_2(dataset: list) -> int:
    """К каждому элементу списка добавляет 17 и вычисляет сумму чисел списка,
        сумма цифр которых делится нацело на 7"""
    new_list = []
    for number in dataset:
        new_list.append(str(int(number)+17))
    return sum_list_1(new_list)  # Верните значение полученной суммы

if __name__ == '__main__':
    my_list = []
    for i in range(1, 11):
        if i % 2 != 0:
            my_list.append(str(i ** 3))  # Соберите нужный список по заданию

    result_1 = sum_list_1(my_list)
    print(result_1)
    result_2 = sum_list_2(my_list)
    print(result_2)