'''Написать скрипт, который выводит статистику для заданной папки в виде словаря,
в котором ключи — верхняя граница размера файла (пусть будет кратна 10), а значения — общее количество файлов
(в том числе и в подпапках), размер которых не превышает этой границы, но больше предыдущей (начинаем с 0), например:
    {
      100: 15,
      1000: 3,
      10000: 7,
      100000: 2
    }
Тут 15 файлов размером не более 100 байт; 3 файла больше 100 и не больше 1000 байт...
Подсказка: размер файла можно получить из атрибута .st_size объекта os.stat.'''

import os

path = 'C:\GB_project'
stat = {}

for root, _, files in os.walk(path):
    for file in files:
        file_size = os.stat(os.path.join(root, file)).st_size
        key = 1
        while key < file_size:
            key *= 10
        if key not in stat:
            stat[key] = [1]
        else:
            stat[key] = [stat[key][0] + 1]

print(stat)
